{
    "version": "https://jsonfeed.org/version/1",
    "title": "My Journal",
    "description": "",
    "home_page_url": "https://ap-9512.github.io",
    "feed_url": "https://ap-9512.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "AP"
    },
    "items": [
        {
            "id": "https://ap-9512.github.io/book-my-thoughts-review-return-to-me.html",
            "url": "https://ap-9512.github.io/book-my-thoughts-review-return-to-me.html",
            "title": "Book: My thoughts + Review: Return to me",
            "summary": "Source: https://www.goodreads.com/book/show/17384512-return-to-meAuthor: Lynn Austin Reading Time: Around 2.5 days Some lines which I felt interesting from the book: This is about astrology, idolatry etc..... “This is how idolatry begins,” Iddo said. “With simple curiosity. Before long, we grow accustomed to seeking signs and omens, and&hellip;",
            "content_html": "<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://ap-9512.github.io/media/posts/11/17384512.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://ap-9512.github.io/media/posts/11/responsive/17384512-xs.jpg 300w ,https://ap-9512.github.io/media/posts/11/responsive/17384512-sm.jpg 480w ,https://ap-9512.github.io/media/posts/11/responsive/17384512-md.jpg 768w ,https://ap-9512.github.io/media/posts/11/responsive/17384512-lg.jpg 1024w ,https://ap-9512.github.io/media/posts/11/responsive/17384512-xl.jpg 1360w ,https://ap-9512.github.io/media/posts/11/responsive/17384512-2xl.jpg 1600w\"  alt=\"Return to me: Lynn Austin\">\n<figcaption >Source: https://www.goodreads.com/book/show/17384512-return-to-me</figcaption>\n</figure>\n<p>Author: Lynn Austin</p>\n<p>Reading Time: Around 2.5 days</p>\n<h2><span data-preserver-spaces=\"true\">First: My thoughts:</span></h2>\n<ul>\n<li><span data-preserver-spaces=\"true\">Women:</span>\n<ul>\n<li><span data-preserver-spaces=\"true\">A person who prays to real god will respect women. </span></li>\n<li><span data-preserver-spaces=\"true\">He will treat all the women in life with dignity. </span></li>\n<li><span data-preserver-spaces=\"true\">He will respect their thoughts, opinions etc.</span></li>\n</ul>\n</li>\n<li><span data-preserver-spaces=\"true\">Every life is important.</span></li>\n<li>Believe in one god, don't simply pray to all the god you will encounter because every religion preaches same thing. But in different ways. If you keep on switching the religions(or all more gods to your religion), then you might interpret the preaching in wrong way(because each religion has its own custom) and do wrong to this world.</li>\n<li>Stay away from all the new Babas flooding the market. They are all pagans.\n<ul>\n<li>In my opinion(Only my opinion and you may disagree. I will respect your opinion also) Sai Baba is very new. So my belief of not praying to him is also okay!🤔</li>\n</ul>\n</li>\n<li> God will answer your questions but not in a way you see in movies. Just keep complete faith in him. But at some point based on your faith, you will certainly <em>feel</em> his presence.</li>\n<li>Every person has a purpose to do in his life(Zechariah's purpose in life was to build the holy temple). You should take that one step in your life to fulfill that purpose. Otherwise somebody else born with the same purpose will do it. Ex: Berekiah and his brother were reluctant to take the chance, they couldn't make it into history.</li>\n<li>Forgive people because they are doing things because of ignorance. They will regret doing such things later in their life.\n<ul>\n<li>Ex: Yael wanted to elope with Rafi. If she had did that even after warning from elders(of course if Rafi would have accepted that proposal), then she would have regretted taking that decision. As god was very kind, he:\n<ul>\n<li>Didn't allow Rafi to accept the proposal for being eloping.</li>\n<li>Sent Zachariah to save her.</li>\n</ul>\n</li>\n<li>Another example is Iddo saw her wife Dinah committing adultery. He forgave her. </li>\n</ul>\n</li>\n<li>You can only win people's heart by love and not by forcing them. Of course god will create an opportunity to express your love. Wait Patiently. </li>\n<li>Patience is always needed. Because you will see so many hurdles in your life before you accomplish your task. Even if you doing something related to god. He will test your patience.</li>\n<li>Never pray to god because you fear him, pray to with love. \n<ul>\n<li>Example: I'm preparing for IAS exam. I can crack the exam and become IAS officer without praying to god also. There are two problems: First, it will take long time. Second, I will achieve success in wrong way because without god's help I will(may) not be able to get rid of masturbation. </li>\n<li>But with god's help I will be able to delegate the task of getting rid of my bad habits(Masturbation + Excess sleep). With this I only have to concentrate on my studies. So I will do it the right way + withing short span of time</li>\n</ul>\n</li>\n<li>If you are confused, or for that matter if you want to start anything pray god for his guidance.</li>\n<li>God might have created stars to foresee, but it is very difficult to predict something just by astrology. You need expertise to predict completely. In my opinion having seen my mother(she is still a beginner) &amp; her gurus, you will always miss a star/something and will get a wrong answer. Also I think, if a person has gained so much expertise to foresee 100% accurately, s/he should also have seen god.\n<ul>\n<li>Example: Recently, these seers were not able to predict the upcoming danger - Corona. They failed completely. They extended the last date for Corona virus as many times as Modi government extended lockdown!!😕</li>\n</ul>\n</li>\n<li>Be brave if you are doing right thing even if it hard and has some dilemmas.\n<ul>\n<li>Example: King Zerubbabel, took a brave decision not to halt the construction of the temple for good of the society even he was asked to stop it.</li>\n</ul>\n</li>\n</ul>\n<p>Some lines which I felt interesting from the book:</p>\n<p>This is about astrology, idolatry etc.....</p>\n<blockquote>\n<p class=\"msg msg--warning\">“This is how idolatry begins,” Iddo said. “With simple curiosity. Before long, we grow accustomed to seeking signs and omens, and they no longer seem like abominations. The idols seem worthy of our worship. The pagans believe they can manipulate their false gods and bribe them to do their bidding. But the Holy One cannot be bribed. Instead we bend our wills to match His. The Torah instructs us to remain separate, to be holy.”</p>\n</blockquote>\n<p>This is about the need for law, restriction on us in the form of religious texts, constitution etc.:</p>\n<blockquote>\n<p class=\"msg msg--warning\">Because we’re not free when there are no boundaries—we’re in great danger.</p>\n</blockquote>\n<p>This is about disability in every person(Conversation between Yael and Hodaya(who is differently abled)):</p>\n<blockquote>\n<p class=\"msg msg--warning\">Every one of us has things about us that aren’t perfect—it’s just that yours is a little more noticeable than ours.<br><br></p>\n</blockquote>\n<p>Finally this is about how problem givers behave:</p>\n<blockquote>\n<p class=\"msg msg--warning\">As the proverb says of evildoers, ‘their feet rush into sin.’</p>\n</blockquote>\n<h2>Review:</h2>\n<p>Babylonian king sees a hand in air(only hand without any person) writing something on a wall when they are partying. Now king gets worried and calls Rebbe Daniel to read the script for king. Daniel reads the script and tells that it is a warning from god for all the mistakes they have committed by taking Jews into captivity and making them slaves. He says that Babylonian king will be killed and conquered by Persians.</p>\n<p>As written by the hand, Persians will conquer the land and kill Babylonian king. Now the talk of whether Jews will be freed from captivity or not starts. But for few months the routine in the kingdoms continues as usual.</p>\n<p>Meanwhile, Zachariah(grandson of Iddo) continues his studies with Torah. Iddo and his family continue their worship etc. as usual. Yael is Zachariah's neighbor and also his friend. Her mother is ill, and Yael's family consult astrologers, pagan gods etc. for her cure. At last her mother dies. But, Yael is lured by a sorceress about the astrology(which according to Jewish tradition is wrong).</p>\n<p>After few months the new king Cyrus accepts that the Jewish people should be left free and should also be allowed to build their temple. Iddo decides to leave but his sons and daughters are not ready to leave because they are satisfied with Babylonian life. Mattaniah(Yael's father) also decides to leave. Zachariah who is close to his grandfather falls in dilemma whether to leave with his grandfather or stay with his parents. At last Zachariah feels the presence of god's message: that he should go to Jerusalem leaving his parents behind.</p>\n<p>Yael dosn't want to leave Babylon because here mother's mortal remains are there and also she likes to learn more about sorcery. So she runs away on the day of journey. But Mattaniah finally finds her and brings her back. They start their journey and reach Jerusalem.</p>\n<p>After their arrival, they are asked to leave by the local people. But Jews continue to stay in Jerusalem. They start building their temple, but will have to face so many hurdles. </p>\n<ul>\n<li>First hurdle comes from local people who like to participate in construction of the temple. But Jews don't like that offer because, if local Samaritans are allowed to participate they will have as much right to offer prayer to god in sanctum, which their god forbids. So they bring political pressure and make sure that the construction activity stops.</li>\n</ul>\n<p>Locals also start terrorist attacks on Jews. In the process Iddo's wife Dinah losses her cousin and best friend ~Soshanna.</p>\n<p>Meanwhile Iddo's decision to convince elders in the Jewish community leads to attack on Soshanna and Dinah. In the process Dinah looses Soshanna. Now Dinah starts blaming Iddo for his decision to both leave her family(sons and daughters) at Babylon and also the decision to convince elders to turn down the offer from locals for building the temple.</p>\n<p>Dinah sees that Joel(Soshanna's husband) feel desolate and tries to comfort him. She suddenly feels happy with Joel. One day when both of them are hugging each other Iddo arrives and feels the agony. At last he forgives her and this causes her so much guilt. Also she tells the truth that Dinah has not committed any physical adultery and only mentally. Of Joel only lures Dinah because he wants to take revenge on Iddo's convincing. Joel's feeling is: \"Iddo and other priests who supported the idea of turning down the offer should have lost their wives.\"</p>\n<p>Matannaiah after reaching Jerusalem itself buys a patch of land from local people and starts farming. In the process Yael makes friend of Land lord and local village leader Zabad's(He is also a Jew) daughter Leyla. Leyla is a weak person and Yael uses her astrology to predict her future and also cheers her up so that usually Leyla's illness reduces. Because of Sorcery she makes new friends(Leyla's grandmother who also has some knowledge and believes sorcery) and also gains so much reputation among locals. </p>\n<p>Now one day Zabad's wife gives birth to a baby with the help of midwife Dinah. But that baby is discarded because of her Disability. Dinah hates that idea and brings that baby to home. She names her Hodaya and is adopted by Iddo and Hodaya. </p>\n<p>Yael's friend Leyla is married to a business person. After few days she dies while giving birth to a baby. Yael along with Leyla's brother Rafi mourn the loss and in the process fall in love with each other. Mattaniah hates that love(Because of their customs and ill respect towards women) and gets Yael married to Zachariah(who from childhood loved her and tried many times to keep her away from Leyla and Sorcery).</p>\n<p>Meanwhile many of Yael's predictions go wrong(even her prediction of getting married with Rafi). After Yael's marriage with Zachariah, Rafi shows his true colour by trying to kill both Yael and Zachariah. Rafi didn't want something which he could get. While Rafi tries to kill both of them, Iddo gets and bad dream and wakes up to see that their grandchildren are under threat and saves them. In the process, Iddo takes a stab in his stomach from Rafi. Rafi is killed in the process. Iddo lives on surviving the attack.</p>\n<p>After few years, drought creates shortage of food and water in Jerusalem. Now they realize that the wrath of god has created this and at the end they start building the temple again.</p>\n<p>This time they are again stopped by local government but they continue the work in spite of threats because of their belief of god. At the end the kingdom archives are searched and they find that the perished king Cyrus's(persian king who conquered the Babylon) proclamation for letting Jews go home and build their temple. New king orders the local government not to cause any trouble for Jews. </p>\n<p>Meanwhile Zachariah feels gods' presence again. </p>\n<p>At the end temple is finished and god starts his journey to stay with the people of Jerusalem. </p>\n<hr>\n<p class=\"align-center\"> </p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "book"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/clarification-i-finally-apologized.html",
            "url": "https://ap-9512.github.io/clarification-i-finally-apologized.html",
            "title": "Clarification: I finally apologized",
            "summary": "Certainly, it was the series of events which led to the petty fight. I should have also mentioned about the pre lunch mood. So I read the book on pent house terrace and was already feeling exhausted by ~12:30. But I waited till 1:00 and&hellip;",
            "content_html": "<p>Certainly, it was the series of events which led to the petty fight.</p>\n<p>I should have also mentioned about the pre lunch mood. So I read the book on pent house terrace and was already feeling exhausted by ~12:30. But I waited till 1:00 and as soon as I went down, things were ready on the table but none of the family members were ready to eat. I waited for arond 5 minutes then I started complaining father \"initially it was 12:30, then 12:45, now 1:00. I think till will only go beyond 1:00.\" I was expressing my need for missing discipline. This, kind of created a bad mood in all the faces. Now father, \"If you want you start eating, why are you waiting for us....\". All this kind of arguments went on.</p>\n<p>And Amma was not happy with the argument and she with her usual sad face came inside and said, \"I was ready, I only wanted 5 minutes to hang the wet clothes........\". I was fed up and went to table took my plate and started serving myself(Of course with a bad mood face). Then may be because of Amma, everybody came to the table for lunch.</p>\n<p>Anyways I have recorded things in the audio about these events for 17 July 2020 recoding.</p>\n<p>As I generally, apologize even for the smallest of the events, I was expecting an apology from my sister. But as soon as my knuckle got hurt, for one time she asked me \"if anything happened\", then after that, she started only to get away from the blame of hurting me. This is what I remember.</p>\n<p>Now, I was furious about the way she was trying to evade blame on her. Because of this only I replied in mocking words.</p>\n<p>But in the evening discussion, Amma told me that she asked if anything happened only. Amma didn't acknowledge about the way she was trying to evade the guilt on her.</p>\n<p>But anyways, Sister was already with her unhappy face and after my night walk, I went to her and apologized with a feeling that I might be wrong.</p>\n<p>Anyways as I said yesterday, let's forget about this stupid petty fight.</p>\n<blockquote>\n<p class=\"msg msg--success\"><em><strong>Om Namah Shivaya🕉🙏</strong></em>.</p>\n</blockquote>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "apology"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/17-july-2020.html",
            "url": "https://ap-9512.github.io/17-july-2020.html",
            "title": "17 July 2020",
            "summary": " Your browser does not support the audio element. Om Namah Sivaya 🕉🙏",
            "content_html": "<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/17-jul-20.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>\n<p class=\"msg msg--success\"><em>Om Namah Sivaya </em>🕉🙏</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "porn",
                   "day"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/can-i-expect-an-apology.html",
            "url": "https://ap-9512.github.io/can-i-expect-an-apology.html",
            "title": "Can I expect an apology?",
            "summary": "Okay listen what happened: I think this is the first test for lord Ganesha to stop me from masturbation because of this anxiety. The ghee in the vessel was not melted. My sister her highness you know is lazy, but for all the praises that&hellip;",
            "content_html": "<p>Okay listen what happened:</p>\n<p>I think this is the first test for lord Ganesha to stop me from masturbation because of this anxiety.</p>\n<p>The ghee in the vessel was not melted. My sister her highness you know is lazy, but for all the praises that she has been receiving(may be I'm not sure), took the ghee vessel and got ghee in it melted. Now you know a lazy person feels even a very small work a very great one. So as soon as she came back to the table asked me to take hold of the ghee vessel. I thought of taking it, but as it was hot I took the plate on which she can keep the vessel.</p>\n<p>But the plate was smaller one, so there are chances that that ghee vessel once place will touch my grip of the plate. She instead of taking the plate for herself and placing on that now started lowering my hand which was catching the plate and in the air. In the process one of my knuckles hit the rice vessel which was already hot.</p>\n<p>Reflex in me pulled back my hand. On whole she didn't want a blame on her which I was able to sense through her words and face. And also she only likes praises, no scolding and other things. Also as this was a small thing I also wanted to leave it. But you know only from few days I am writing these posts and will take time before I will become very cool person. Now for the question : \"Did anything happen?\", I replied: \"nothing happened, nothing...\" - but what happened was the tone was mocking. Because I was not speaking from my heart.</p>\n<p>Soon a fight erupted. But my tone was mocking because she didn't want to hear wrongdoing. She is always like that. Lunch went on silently, she ate very fast or may be very less I don't know. After she completed her lunch, I asked Amma if I was wrong? Now she said that I didn't know how to talk and that is the reason why I'm facing all the problems. To which I replied: \"I always want to tell the truth, want transparency. But as soon as I speak truth(what my heart says), everybody is crying and don't even want to listen to me! Now I want to speak something, but I'm speaking of something else because of which I'm unable to convey my words correctly.\" Tears rolled down her eyes. Amma's reply: \"Very good, very good, you are feared of sister, I'm feared of you, etc.\" But you know she didn't say that everybody in the house are feared of her also. Then father replied to Amma: \"I'm feared of you\"...........</p>\n<p>Now my question to you is:</p>\n<p class=\"msg msg--info\">My knuckles got hurt(of course it was very small one). It was because of her laziness this happened. Generally I apologize for even the smallest of the harm(both mentally and physically), sometimes even there is no fault of mine. Should I expect an apology?</p>\n<p>My heart says it is a very simple thing, if physically harm was not that much and you wanted to neglect it then the way you spoke should have hurt her and you should apologize her.</p>\n<p>But my heart says this should be left.......There is some nullity in my mind as I write this post. Is it just because of burning my hand should I expect a sorry?</p>\n<p>NO.........</p>\n<p>I'm not expecting any sorry and also I will not apologize because it was a series of things that happened. May I should change my attitude. Try not to say anything mockingly if you can't say it in correct way. I now feel my attitude is only wrong. </p>\n<p>Fine I will change it.</p>\n<p>Thank you lord Shiva now I don't have any anxiety and anger. I'm cool. But it took me around 1:30 hrs to cool down. With god's blessings this time will only reduce and I will be cool not anger, no anxiety....only love......only happiness.......only cheerfulness..............</p>\n<p>This is very silly thing to take into my mind. AP leave it.</p>\n<p>To cooldown I generally listen to this music(I have listened to this music and many more while I was writing this post):</p>\n<p><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/38420037&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\"></iframe></div></p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "fight"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/16-july-2020.html",
            "url": "https://ap-9512.github.io/16-july-2020.html",
            "title": "16 July 2020",
            "summary": " Your browser does not support the audio element. Clarification: I wanted to write this quote yesterday itself(Actually I framed this a few days ago): If you can't apologize, you can't forgive If you can't forgive, you can't grow Edit 1: 16 July 2020 If&hellip;",
            "content_html": "<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/16-jul-20.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>\n<p>Clarification:</p>\n<ul>\n<li>I loved cooking, but the Paratha was okay.</li>\n<li>Prayers were heard.</li>\n<li>If I keep my calmness and coolness, then I can bring back all the happiness in my mother's life may be by becoming IAS or by not being angry myself etc.</li>\n</ul>\n<p>I wanted to write this quote yesterday itself(Actually I framed this a few days ago):</p>\n<blockquote>\n<p>If you can't apologize, you can't forgive</p>\n<p>If you can't forgive, you can't grow</p>\n</blockquote>\n<p>Edit 1: 16 July 2020</p>\n<blockquote>\n<p>If you can't apologize, you can't forgive</p>\n<p>If you can't forgive, you can never forgive yourself</p>\n<p>If you can never forgive yourself, you can never forgive others</p>\n<p>For the attitude of forgiving is an indication of wisdom, enlightenment, salvation....</p>\n</blockquote>\n<p class=\"msg msg--success\"><em>Om Namah Sivaya </em>🕉🙏</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "day"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/about-my-porn-habit.html",
            "url": "https://ap-9512.github.io/about-my-porn-habit.html",
            "title": "About my porn habit",
            "summary": "Actually I don't watch porn for hours and hours because it only became a \"habit\" from end of last december. Also I don't have that much sperm count as apparent from the falling of my dick after first ejaculation. Okay, coming back I regret having&hellip;",
            "content_html": "<p>Actually I don't watch porn for hours and hours because it only became a \"<em>habit\"</em> from end of last december. Also I don't have that much sperm count as apparent from the falling of my dick after first ejaculation. Okay, coming back I regret having this bad habit, but you know it had its own advantages during my GATE exam last month preparation. It will give you some dose of adrenaline which you can help overcome anxiety. But now I'm fighting very hard to get rid of this bloody thing. First thing I did was start cycling back again(of course for fitness also) so that most of my energy is spent in cycling and less amount of energy is left for masturbation. </p>\n<p>Now this stupid corona, I am taking many many breaks and with so much of energy your body will only remind you of Julia Anna. Isn't it? What a sexy porn star she is! Her boobs make my dick rise, her seduction and her laugh make my dick rise. Of course these are all manly things which I should experience in my life, but now too far.</p>\n<p>Now of course I feel like squeezing the sperms out of my dick watching the M<em>adam</em>ILF!!</p>\n<p>And by the way I don't want to blame corona for my porn watching, I should atleast find some other way to use my energy. Maybe as many say, watching porn by me is something of an excuse for some other inner insecurity feeling in me? Or am I one of those scoundrels who don't have control on their senses? I can't answer that for sure, because I wanted to go a trip for so long after my GATE results(which of course was great).</p>\n<p>I can say one thing, I respect women to their fullest. But my gut feeling says I will leave this bad habit once Corona is gone. But I'm not sure because I don't know when I will get a chance to travel so that my inner one will forget all the stupid things.</p>\n<blockquote>\n<p>Neurons that fire together, wire together</p>\n</blockquote>\n<p>So what is happening is, during my GATE and other exams preparation(mostly during the end) when ever I used to feel anxiety after mock test score, to continue with the preparation and to feel cheerful I thought of masturbation. Now inner me knows it is a very bad idea so it used to feel more anxiety. So in total:</p>\n<blockquote>\n<p>Exam anxiety + Porn anxiety = more anxiety.</p>\n</blockquote>\n<p>But you know after masturbation, your anxiety levels are very low. Now what happened was, the neurons wired together that whenever I will feel anxiety even if it very small thing I feel like masturbating and vice versa.</p>\n<p>You know? I don't feel like masturbating whenever I don't feel anxious, but you know life is after all filled with complete anxieties.</p>\n<p>Now as I write, I feel like:</p>\n<blockquote>\n<p>To get rid of this bad habit, don't go the straight way. Take another route!</p>\n</blockquote>\n<p>I thought of masturbating only when I'm not anxious, but what if this will misfire in another way? i.e. may be in future I will feel like masturbating just simply?</p>\n<p>I am also thinking of taking help of great lord Ganesha whom I stopped praying from last july.</p>\n<p>Holy fuck!! now I understand, when I did my prayers I somehow woke up early, only watched sexy stuff(never masturbated). But after I joined coaching, I completely stopped my prayers. Slowly these two(sleep+porn) bad habits caught hold of me.</p>\n<p>Okay from today, I will make a oath that I will pray even if I wake up late. Now I can complete the puzzle, which I will save it for another post because may be with this enlightenment I will stop masturbating for many years to come, because without getting rid of this bad habit, someday there are many chances that this fantasy may slowly develop into a misogyny. I also fear, if this bad habit is not deforested when it is still a plant, I can never be a best administrator.</p>\n<p class=\"msg msg--info\">For now in my life, masturbation and women are completely different. Masturbation(with aid of porn) is just a cure for my anxiety. I have immense respect for women, their problems.</p>\n<p class=\"msg msg--info\">I will be honored if god will give me a chance to serve, empower and uplift the women in this country and where ever they face problems for I cannot bear the sufferings.</p>\n<p>To be frank with you, as soon as I thought of prayers, my gut feeling says this is the solution I was searching for. Now even if I'm thinking of Julia Ann I don't feel like masturbating. Wow, first good omen. Isn't it?</p>\n<p>Okay bye for now.</p>\n<p>I thank god for giving this opportunity to live this great life. I thank him for the feeling of love, empathy, compassion which I have towards poor(especially women, old and children). I thank you my god for telling me the real cause of my porn habit which I will certainly utilize to get rid of this bad habit.</p>\n<p>I thank you for making me take a break, read books(especially 5AM club book) followed by Anne Frank diary. </p>\n<p>Thank you Lord Shiva, Thank you.</p>\n<p class=\"msg msg--success\"><span style=\"text-decoration: underline;\"><strong><em>Om Namah Shivaya </em>🕉🙏</strong></span></p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "porn"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/15-july-2020.html",
            "url": "https://ap-9512.github.io/15-july-2020.html",
            "title": "15 July 2020",
            "summary": " Your browser does not support the audio element. ",
            "content_html": "<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/15-jul-20.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "day"
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/my-first-voice-test.html",
            "url": "https://ap-9512.github.io/my-first-voice-test.html",
            "title": "My First Voice Test!!",
            "summary": "Okay so lets see how this will work. Now this is a new file format. I don't really know which browser/s supports these file formats. Your browser does not support the audio element. May god bless me with this journey. I'm thankful to him. My&hellip;",
            "content_html": "<p>Okay so lets see how this will work. Now this is a new file format. I don't really know which browser/s supports these file formats.</p>\n<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/test-record.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>\n<p>May god bless me with this journey. I'm thankful to him. My only prayer is <em>\"Please don't trouble my parents &amp; Sister with anything, if you want solution for any problem inflict that upon me. But remember: there shouldn't be any trouble for my family as they cannot take anything which is naive.\"</em></p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/test-for-uploading-audio-files.html",
            "url": "https://ap-9512.github.io/test-for-uploading-audio-files.html",
            "title": "Test for uploading Audio Files",
            "summary": "So there you go: This audio file was one of my favorite music. Disclaimer: I am not the owner of this file but I am not able to post the link here because I only have a download and forgot from where I've downloaded this.",
            "content_html": "<p>So there you go:</p>\n<p>This audio file was one of my favorite music.</p>\n<p>Disclaimer: I am not the owner of this file but I am not able to post the link here because I only have a download and forgot from where I've downloaded this.</p>\n<p><audio loading=\"lazy\" controls=\"controls\">\n  <source src=\"https://github.com/ap-9512/audio/blob/master/hip-hop-beat.mp3?raw=true\" type=\"audio/mp4\" />\nYour browser does not support the audio element.</audio></p>\n<p>So lets see if this will work.</p>\n<p>I am very excited!!</p>\n<p>Thank you god for helping me with this concept. 😊</p>\n<h2>Okay my learnings:</h2>\n<p>I've tested this concept and it only works on Google chrome, Mozilla!</p>\n<p>You might ask me why I'm checking browser compatibility if the website is not for general public: The answer is \"Yes, it is not for public for now! But, in future if I feel like publishing the website, I cannot simply keep on editing the posts for ever!!\"</p>\n<p>And by the way I have tried opening this website preview on edge and the whole website itself is dirty, how can I expect it to play my audio file??😁</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        },
        {
            "id": "https://ap-9512.github.io/my-first-post.html",
            "url": "https://ap-9512.github.io/my-first-post.html",
            "title": "My First Post",
            "summary": "Alright, this will be a test post for my journal, which probably will be a voice recorded one so as to save time. I also think it will help me to improve my speaking skills. As this is an anonymous website, I will be true&hellip;",
            "content_html": "<p>Alright, this will be a test post for my journal, which probably will be a voice recorded one so as to save time. I also think it will help me to improve my speaking skills.</p>\n<p>As this is an anonymous website, I will be true to the best of my <em>\"conscience\".</em></p>\n<p>Okay let's have a head-start. </p>\n<p>If I feel like editing this one, then I will add a new post, as internet is unlimited.</p>\n<p>Actually in the past I used to write all my entries on a wordpress blog, but now as the files I will upload will be audio files and the size is limited on wordpress to approx 5GB, I have thought of this. And of course, wordpress website that I created is not published and it has my name. So for now, till I achieve my greatness I cannot publish that website and also this website will be search engine <em>\"unfriendly!!</em>😉<em>\"</em></p>\n<p>May God bless me with this activity, help me with this activity.</p>\n<p>Edit 1: 16 Jul 2016</p>\n<p>As I have made the audio part private repo, I'm not fearful anymore and so think the website can be published. But I'm not going to care for the SEO part(I'm not doing this for money, it is for cooling myself down, expressing my thoughts......).</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-17T18:31:16+05:30",
            "date_modified": "2020-07-17T18:31:16+05:30"
        }
    ]
}
