{
    "version": "https://jsonfeed.org/version/1",
    "title": "My Journal",
    "description": "",
    "home_page_url": "https://ap-9512.github.io",
    "feed_url": "https://ap-9512.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "AP"
    },
    "items": [
        {
            "id": "https://ap-9512.github.io/about-my-porn-habit.html",
            "url": "https://ap-9512.github.io/about-my-porn-habit.html",
            "title": "About my porn habit",
            "summary": "Actually I don't watch porn for hours and hours because it only became a \"habit\" from end of last december. Also I don't have that much sperm count as apparent from the falling of my dick after first ejaculation. Okay, coming back I regret having&hellip;",
            "content_html": "<p>Actually I don't watch porn for hours and hours because it only became a \"<em>habit\"</em> from end of last december. Also I don't have that much sperm count as apparent from the falling of my dick after first ejaculation. Okay, coming back I regret having this bad habit, but you know it had its own advantages during my GATE exam last month preparation. It will give you some dose of adrenaline which you can help overcome anxiety. But now I'm fighting very hard to get rid of this bloody thing. First thing I did was start cycling back again(of course for fitness also) so that most of my energy is spent in cycling and less amount of energy is left for masturbation. </p>\n<p>Now this stupid corona, I am taking many many breaks and with so much of energy your body will only remind you of Julia Anna. Isn't it? What a sexy porn star she is! Her boobs make my dick rise, her seduction and her laugh make my dick rise. Of course these are all manly things which I should experience in my life, but now too far.</p>\n<p>Now of course I feel like squeezing the sperms out of my dick watching the M<em>adam</em>ILF!!</p>\n<p>And by the way I don't want to blame corona for my porn watching, I should atleast find some other way to use my energy. Maybe as many say, watching porn by me is something of an excuse for some other inner insecurity feeling in me? Or am I one of those scoundrels who don't have control on their senses? I can't answer that for sure, because I wanted to go a trip for so long after my GATE results(which of course was great).</p>\n<p>I can say one thing, I respect women to their fullest. But my gut feeling says I will leave this bad habit once Corona is gone. But I'm not sure because I don't know when I will get a chance to travel so that my inner one will forget all the stupid things.</p>\n<blockquote>\n<p>Neurons that fire together, wire together</p>\n</blockquote>\n<p>So what is happening is, during my GATE and other exams preparation(mostly during the end) when ever I used to feel anxiety after mock test score, to continue with the preparation and to feel cheerful I thought of masturbation. Now inner me knows it is a very bad idea so it used to feel more anxiety. So in total:</p>\n<blockquote>\n<p>Exam anxiety + Porn anxiety = more anxiety.</p>\n</blockquote>\n<p>But you know after masturbation, your anxiety levels are very low. Now what happened was, the neurons wired together that whenever I will feel anxiety even if it very small thing I feel like masturbating and vice versa.</p>\n<p>You know? I don't feel like masturbating whenever I don't feel anxious, but you know life is after all filled with complete anxieties.</p>\n<p>Now as I write, I feel like:</p>\n<blockquote>\n<p>To get rid of this bad habit, don't go the straight way. Take another route!</p>\n</blockquote>\n<p>I thought of masturbating only when I'm not anxious, but what if this will misfire in another way? i.e. may be in future I will feel like masturbating just simply?</p>\n<p>I am also thinking of taking help of great lord Ganesha whom I stopped praying from last july.</p>\n<p>Holy fuck!! now I understand, when I did my prayers I somehow woke up early, only watched sexy stuff(never masturbated). But after I joined coaching, I completely stopped my prayers. Slowly these two(sleep+porn) bad habits caught hold of me.</p>\n<p>Okay from today, I will make a oath that I will pray even if I wake up late. Now I can complete the puzzle, which I will save it for another post because may be with this enlightenment I will stop masturbating for many years to come, because without getting rid of this bad habit, someday there are many chances that this fantasy may slowly develop into a misogyny. I also fear, if this bad habit is not deforested when it is still a plant, I can never be a best administrator.</p>\n<p class=\"msg msg--info\">For now in my life, masturbation and women are completely different. Masturbation(with aid of porn) is just a cure for my anxiety. I have immense respect for women, their problems.</p>\n<p class=\"msg msg--info\">I will be honored if god will give me a chance to serve, empower and uplift the women in this country and where ever they face problems for I cannot bear the sufferings.</p>\n<p>To be frank with you, as soon as I thought of prayers, my gut feeling says this is the solution I was searching for. Now even if I'm thinking of Julia Ann I don't feel like masturbating. Wow, first good omen. Isn't it?</p>\n<p>Okay bye for now.</p>\n<p>I thank god for giving this opportunity to live this great life. I thank him for the feeling of love, empathy, compassion which I have towards poor(especially women, old and children). I thank you my god for telling me the real cause of my porn habit which I will certainly utilize to get rid of this bad habit.</p>\n<p>I thank you for making me take a break, read books(especially 5AM club book) followed by Anne Frank diary. </p>\n<p>Thank you Lord Shiva, Thank you.</p>\n<p class=\"msg msg--success\"><span style=\"text-decoration: underline;\"><strong><em>Om Namah Shivaya </em>🕉🙏</strong></span></p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "porn"
            ],
            "date_published": "2020-07-15T18:07:04+05:30",
            "date_modified": "2020-07-15T18:07:04+05:30"
        },
        {
            "id": "https://ap-9512.github.io/15-july-2020.html",
            "url": "https://ap-9512.github.io/15-july-2020.html",
            "title": "15 July 2020",
            "summary": " Your browser does not support the audio element. ",
            "content_html": "<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/15-jul-20.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>",
            "author": {
                "name": "AP"
            },
            "tags": [
                   "day"
            ],
            "date_published": "2020-07-15T18:07:04+05:30",
            "date_modified": "2020-07-15T18:07:04+05:30"
        },
        {
            "id": "https://ap-9512.github.io/my-first-voice-test.html",
            "url": "https://ap-9512.github.io/my-first-voice-test.html",
            "title": "My First Voice Test!!",
            "summary": "Okay so lets see how this will work. Now this is a new file format. I don't really know which browser/s supports these file formats. Your browser does not support the audio element. May god bless me with this journey. I'm thankful to him. My&hellip;",
            "content_html": "<p>Okay so lets see how this will work. Now this is a new file format. I don't really know which browser/s supports these file formats.</p>\n<p><audio loading=\"lazy\" controls=\"controls\" controlslist=\"nodownload\" src=\"https://github.com/ap-9512/audio/blob/master/test-record.m4a?raw=true\">\n            Your browser does not support the\n            <code>audio</code> element.\n    </audio></p>\n<p>May god bless me with this journey. I'm thankful to him. My only prayer is <em>\"Please don't trouble my parents &amp; Sister with anything, if you want solution for any problem inflict that upon me. But remember: there shouldn't be any trouble for my family as they cannot take anything which is naive.\"</em></p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-15T18:07:04+05:30",
            "date_modified": "2020-07-15T18:07:04+05:30"
        },
        {
            "id": "https://ap-9512.github.io/test-for-uploading-audio-files.html",
            "url": "https://ap-9512.github.io/test-for-uploading-audio-files.html",
            "title": "Test for uploading Audio Files",
            "summary": "So there you go: This audio file was one of my favorite music. Disclaimer: I am not the owner of this file but I am not able to post the link here because I only have a download and forgot from where I've downloaded this.",
            "content_html": "<p>So there you go:</p>\n<p>This audio file was one of my favorite music.</p>\n<p>Disclaimer: I am not the owner of this file but I am not able to post the link here because I only have a download and forgot from where I've downloaded this.</p>\n<p><audio loading=\"lazy\" controls=\"controls\">\n  <source src=\"https://github.com/ap-9512/audio/blob/master/hip-hop-beat.mp3?raw=true\" type=\"audio/mp4\" />\nYour browser does not support the audio element.</audio></p>\n<p>So lets see if this will work.</p>\n<p>I am very excited!!</p>\n<p>Thank you god for helping me with this concept. 😊</p>\n<h2>Okay my learnings:</h2>\n<p>I've tested this concept and it only works on Google chrome, Mozilla!</p>\n<p>You might ask me why I'm checking browser compatibility if the website is not for general public: The answer is \"Yes, it is not for public for now! But, in future if I feel like publishing the website, I cannot simply keep on editing the posts for ever!!\"</p>\n<p>And by the way I have tried opening this website preview on edge and the whole website itself is dirty, how can I expect it to play my audio file??😁</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-15T18:07:04+05:30",
            "date_modified": "2020-07-15T18:07:04+05:30"
        },
        {
            "id": "https://ap-9512.github.io/my-first-post.html",
            "url": "https://ap-9512.github.io/my-first-post.html",
            "title": "My First Post",
            "summary": "Alright, this will be a test post for my journal, which probably will be a voice recorded one so as to save time. I also think it will help me to improve my speaking skills. As this is an anonymous website, I will be true&hellip;",
            "content_html": "<p>Alright, this will be a test post for my journal, which probably will be a voice recorded one so as to save time. I also think it will help me to improve my speaking skills.</p>\n<p>As this is an anonymous website, I will be true to the best of my <em>\"conscience\".</em></p>\n<p>Okay let's have a head-start. </p>\n<p>If I feel like editing this one, then I will add a new post, as internet is unlimited.</p>\n<p>Actually in the past I used to write all my entries on a wordpress blog, but now as the files I will upload will be audio files and the size is limited on wordpress to approx 5GB, I have thought of this. And of course, wordpress website that I created is not published and it has my name. So for now, till I achieve my greatness I cannot publish that website and also this website will be search engine <em>\"unfriendly!!</em>😉<em>\"</em></p>\n<p>May God bless me with this activity, help me with this activity.</p>",
            "author": {
                "name": "AP"
            },
            "tags": [
            ],
            "date_published": "2020-07-15T18:07:04+05:30",
            "date_modified": "2020-07-15T18:07:04+05:30"
        }
    ]
}
